app/views/wflows/show.html.erb

  <tr>
  <% @wflow.wtasks.each do |wtasks| %>
---
SELECT "wtasks".* FROM "wtasks" WHERE "wtasks"."wflow_id" = 2

    <td>
      <% wtasks.wtask_ports.each do |wtask_ports| %>
---
SELECT "wtask_ports".* FROM "wtask_ports" WHERE "wtask_ports"."wtask_id" = 4