app/views/wtasks/show.html.erb

  <tr>
  <% @wtask.wtask_ports.each do |wtask_ports| %>
---
SELECT "wtask_ports".* FROM "wtask_ports" WHERE "wtask_ports"."wtask_id" = 4