app/controllers/muscles_controller.rb


      #if job_ib exists -> means this task is successfully running
      #Update this task's status from 'initial' to 'done'
      @wtask = Wtask.find(wtaskid)
      @wtask.update_attribute('wtask_status', 'done')

      #copy the completed alignment file back to workflow folder
      @wflow = Wflow.find(@wtask[:wflow_id])
---
SELECT "wtasks".* FROM "wtasks" WHERE "wtasks"."id" = $1 LIMIT 1  [["id", "15"]]
UPDATE "wtasks" SET "wtask_folder" = '2012-12-11-1355246941', "updated_at" = '2012-12-11 17:29:01.330548' WHERE "wtasks"."id" = 15
SELECT "wflows".* FROM "wflows" WHERE "wflows"."id" = $1 LIMIT 1  [["id", 13]]


      #:wtask_id, :ptype, :ploc
      #http://apidock.com/rails/v3.1.0/ActiveRecord/Base/assign_attributes
      @wtask_ports = Workflow::WtaskPort.where( :wtask_id => wtaskid)
      @wtask_ports.each do |a|
---
SELECT "wtask_ports".* FROM "wtask_ports" WHERE "wtask_ports"."wtask_id" = 25
SELECT "wtask_ports".* FROM "wtask_ports" WHERE "wtask_ports"."id" = $1 LIMIT 1  [["id", "25"]]

        puts 'pname is :: ' + @wtask_port["pname"]

        if @wtask_port["pname"] == "source"
          @wtask_port.update_attribute('ploc', "/services/rest/muscle/result/" + seq_dest)
---
UPDATE "wtask_ports" SET "ploc" = 'XXXXXXXXXXXXXXXXXXXXx', "updated_at" = '2012-12-11 21:15:04.012125' WHERE "wtask_ports"."id" = 18